<template>
  <div class="russian">
 
   <button @click="getResult">get in russian</button>
     <div class="result">{{result}}</div>
  </div>
</template>

<script>
// @ is an alias to /src


export default {
  name: 'Home',
  components: {

  },
 data() { return {
      array:["Укуси мой блестящий металлический зад!", "Кто вы такие и почему это должно меня волновать?!", "Не бейте меня!.. Я предам кого угодно!", "На помощь! На помощь! Я слишком ленив, чтобы спасаться!", "Ненавижу людей, которые меня любят. И они меня ненавидят!", "Сравните свою жизнь с моей, а потом убейте себя!", "Укуси мой блестящий металлический зад!", "«Шантаж» звучит как-то вульгарно, мне больше нравится «вымогательство», - звучит как музыка.", "Я люблю вас, мешки с костями.", "Я хочу жить! Я ещё много чего не украл!", "Когда я вырасту, то хочу быть паровым экскаватором!", "Отличное будущее! Поселимся на той горе из черепов.", "Мне большой диетический вискарь и попкорн с двойным моторным маслом.", "71 «Хомо де Лайт», 57 «Шато Портей» и 66 «Тендершейк», смешайте всё в большое ведро.", "Никогда не думал что меня прикончит Санта-Клаус, сказали бы — не поверил.", "Пока я командую, любая миссия суицидальная.", "Бог мой, надо что-то предпринять… но я уже в пижаме.", "Убить всех человеков… Я должен убить всех человеков."],
    //  array: ["a", "b","c"],
  result: "",}
 },
  methods: {
       getResult() {

        let idx = [Math.floor(Math.random()*this.array.length)]
        this.result = this.array[idx]
       }
       }
}
</script>
